/***************************************************************************
* Module Operation Explanation
* Replace &name& with the name of the file
* Fills the include, flaged with +include+
* Fills the definition flaged with =====
*
****************************************************************************/

/***************************************************************************
****************************************************************************
*Copyright(c),2008-2028,广州数控设备有限公司
*File name: decode_instructions.c
*First Author: 
*Date:06/17/2009  
*文件功能描述：
****************************************************************************
****************************************************************************/

#define  DECODE_INSTRUCTIONS_GLOBALS

/**********************************************************************/
/*Add all #includes here*/
#include "decode_parse_file.h"
#include "decode_instructions.h"
#include "decode_public.h"
#include "robotdecodepublic.h"
/**********************************************************************/

/**********************************************************************/
/*Add all #defines here*/
decode_instruction_index_info DecodeInstrIndexInfoGlobalTable;
//以下中数据类型应当与界面提供的数据类型存储索引一致
//类型成员解释：低16位表示参数类型，bit16~bit23位表示所在的参数顺序(从0开始编号)，可选互斥的顺序相同，高8位是否必选参数，-1表示无效
decode_instruction_info DecodeInstrInfoGlobalTable[INSTR_END_CNT+1] = {
    {{{" ", 0xFFFFFFFF}}, NULL},//预留一个空，与decode_instruction_enum类型顺序保持一致
    {{{"!", 0x01000000}}, NULL},//为注释
    {{{"<SMT>", 0x01000000}}, NULL},//预留一个空，与decode_instruction_enum类型顺序保持一致
    {{{"MODULE", 0x01000000}}, NULL},
    {{{"ENDMODULE", 0x01000000}}, NULL},
    {{{"PROC", 0x01000000}}, NULL},
    {{{"ENDPROC", 0x01000000}}, NULL},
//速度和加速度相关指令
    {{{"AccSet", 0x01000000}}, NULL},
    {{{"WorldAccLim", 0x01000000}}, NULL},
    {{{"PathAccLim", 0x01000000}}, NULL},
    {{{"SpeedLimAxis", 0x01000000}}, NULL},
    {{{"SpeedLimCheckPoint", 0x01000000}}, NULL},
    {{{"SpeedRefresh", 0x01000000}}, NULL},
    {{{"VelSet", 0x01000000}}, NULL},
//运动相关配置
    {{{"ConfJ", 0x01000000}}, NULL},
    {{{"ConfL", 0x01000000}}, NULL},
    {{{"ActUnit", 0x01000000}}, NULL},
    {{{"DeactUnit", 0x01000000}}, NULL},
    {{{"MechUnitLoad", 0x01000000}}, NULL},
    {{{"GripLoad", 0x01000000}}, NULL},
    {{{"MotionSup", 0x01000000}}, NULL},
    {{{"SingArea", 0x01000000}}, NULL},
    {{{"CirPathMode", 0x01000000}}, NULL},
//触发操作相关指令
    {{{"EOffsOn", 0x01000000}}, NULL},
    {{{"EOffsOff", 0x01000000}}, NULL},
    {{{"EOffsSet", 0x01000000}}, NULL},
    {{{"PDispSet", 0x01000000}}, NULL},
    {{{"PDispOn", 0x01000000}}, NULL},
    {{{"PDispOff", 0x01000000}}, NULL},
    {{{"TriggCheckIO", 0x01000000}}, NULL},
    {{{"TriggIO", 0x01000000}}, NULL},
    {{{"TriggEquip", 0x01000000}}, NULL},
    {{{"TriggInt", 0x01000000}}, NULL},
    {{{"TriggRampAO", 0x01000000}}, NULL},
    {{{"TriggSpeed", 0x01000000}}, NULL},
//运动指令
    {{{"MoveAbsJ", 0x01000000}}, NULL},
    {{{"MoveExtJ", 0x01000000}}, NULL},
    //以下要注意MOVE中传递*的情况，还没添加
    {{{"MOVEJ", 0x01000000}, {"\\CONC", 0x00010002}, {"TOPOINT", 0x01020001}, {"\\ID", 0x00030003}, {"SPEED", 0x01040004}, {"\\V", 0x00050005}, {"\\T", 0x00050005}, {"ZONE", 0x01060006}, {"\\Z", 0x00070005}, {"\\INPOS", 0x00080007}, {"TOOL", 0x01090008}, {"\\WOBJ", 0x000A0009}, {"\\TLOAD", 0x000B000A}, {" ", 0xFFFFFFFF}}, decodeInstructMovejExecute},
    {{{"MoveL", 0x01000000}}, NULL},
    {{{"MoveC", 0x01000000}}, NULL},
    {{{"SearchC", 0x01000000}}, NULL},
    {{{"SearchExtJ", 0x01000000}}, NULL},
    {{{"SearchL", 0x01000000}}, NULL},
    {{{"TriggJ", 0x01000000}}, NULL},
    {{{"TriggL", 0x01000000}}, NULL},
    {{{"TriggC", 0x01000000}}, NULL},
    {{{"TriggLIOs", 0x01000000}}, NULL},
    {{{"ClearPath", 0x01000000}}, NULL},
    {{{"StorePath", 0x01000000}}, NULL},
    {{{"RestoPath", 0x01000000}}, NULL},
    {{{"StartMove", 0x01000000}}, NULL},
    {{{"StartMoveRetry", 0x01000000}}, NULL},
    {{{"StopMove", 0x01000000}}, NULL},
    {{{"StopMoveReset", 0x01000000}}, NULL},
};


//decode_instruction_info d_instr_info_global_table[INSTR_END_CNT+1] = {//支持的指令索引表，该表顺序要与decode_instruction_enum一致
//第一条指令为空
//	{"NULL", D_INSTR_TYPE_NULL, 0, 0, NULL},
/*
//速度和加速度相关指令
	{"ACCSET", D_INSTR_TYPE_VELACC, 2, 1, decode_instruct_accset_proc},
	{"WORLDACCLIM", D_INSTR_TYPE_VELACC, 0, 1, decode_instruct_worldacclim_proc},
	{"PATHACCLIM", D_INSTR_TYPE_VELACC, 2, 2, decode_instruct_pathacclim_proc},
	{"SPEEDLIMAXIS", D_INSTR_TYPE_VELACC, 3, 0, decode_instruct_speedlimaxis_proc},
	{"SPEEDLIMCHECKPOINT", D_INSTR_TYPE_VELACC, 1, 0, decode_instruct_speedlimcheckpoint_proc},
	{"SPEEDREFRESH", D_INSTR_TYPE_VELACC, 1, 0, decode_instruct_speedrefresh_proc},
	{"VELSET", D_INSTR_TYPE_VELACC, 2, 0, decode_instruct_velset_proc},
//运动相关配置指令
	{"CONFJ", D_INSTR_TYPE_MOTIONCFG, 0, 1, decode_instruct_confj_proc},
	{"CONFL", D_INSTR_TYPE_MOTIONCFG, 0, 1, decode_instruct_confl_proc},
	{"ACTUNIT", D_INSTR_TYPE_MOTIONCFG, 1, 0, decode_instruct_actunit_proc},
	{"DEACTUNIT", D_INSTR_TYPE_MOTIONCFG, 1, 0, decode_instruct_deactunit_proc},
	{"MECHUNITLOAD", D_INSTR_TYPE_MOTIONCFG, 3, 0, decode_instruct_mechunitload_proc},
	{"GRIPLOAD", D_INSTR_TYPE_MOTIONCFG, 1, 0, decode_instruct_gripload_proc},
	{"MOTIONSUP", D_INSTR_TYPE_MOTIONCFG, 0, 2, decode_instruct_motionsup_proc},
	{"SINGAREA", D_INSTR_TYPE_MOTIONCFG, 0, 1, decode_instruct_singarea_proc},
	{"CIRPATHMODE", D_INSTR_TYPE_MOTIONCFG, 0, 1, decode_instruct_cirpathmode_proc},
	{"EOFFSON", D_INSTR_TYPE_MOTIONCFG, 1, 1, decode_instruct_eoffson_proc},
	{"EOFFSOFF", D_INSTR_TYPE_MOTIONCFG, 0, 0, decode_instruct_eoffsoff_proc},
	{"EOFFSSET", D_INSTR_TYPE_MOTIONCFG, 1, 0, decode_instruct_eoffsset_proc},
	{"PDISPSET", D_INSTR_TYPE_MOTIONCFG, 1, 0, decode_instruct_pdispset_proc},
	{"PDISPON", D_INSTR_TYPE_MOTIONCFG, 2, 3, decode_instruct_pdispon_proc},
	{"PDISPOFF", D_INSTR_TYPE_MOTIONCFG, 0, 0, decode_instruct_pdispoff_proc},
	{"TRIGGCHECKIO", D_INSTR_TYPE_MOTIONCFG, 6, 2, decode_instruct_triggcheckio_proc},
	{"TRIGGIO", D_INSTR_TYPE_MOTIONCFG, 3, 3, decode_instruct_triggio_proc},
	{"TRIGGEQUIP", D_INSTR_TYPE_MOTIONCFG, 4, 3, decode_instruct_triggequip_proc},
	{"TRIGGINT", D_INSTR_TYPE_MOTIONCFG, 3, 1, decode_instruct_triggint_proc},
	{"TRIGGRAMPAO", D_INSTR_TYPE_MOTIONCFG, 6, 2, decode_instruct_triggrampao_proc},
	{"TRIGGSPEED", D_INSTR_TYPE_MOTIONCFG, 5, 4, decode_instruct_triggspeed_proc},
//运动指令
	{"MOVEABSJ", D_INSTR_TYPE_MOTION, 4, 9, decode_instruct_moveabsj_proc},
	{"MOVEEXTJ", D_INSTR_TYPE_MOTION, 3, 5, decode_instruct_moveextj_proc},
*/
//	{"MOVEJ", D_INSTR_TYPE_MOTION, 4, 8, decode_instruct_movej_analysis, decode_instruct_movej_execute},
/*	{"MOVEL", D_INSTR_TYPE_MOTION, 4, 8, decode_instruct_movel_proc},
	{"MOVEC", D_INSTR_TYPE_MOTION, 5, 8, decode_instruct_movec_proc},
	{"SEARCHC", D_INSTR_TYPE_MOTION, 6, 7, decode_instruct_searchc_proc},
	{"SEARCHEXTJ", D_INSTR_TYPE_MOTION, 3, 5, decode_instruct_searchextj_proc},
	{"SEARCHL", D_INSTR_TYPE_MOTION, 5, 8, decode_instruct_searchl_proc},
	{"TRIGGJ", D_INSTR_TYPE_MOTION, 5, 13, decode_instruct_triggj_proc},
	{"TRIGGL", D_INSTR_TYPE_MOTION, 5, 14, decode_instruct_triggl_proc},
	{"TRIGGC", D_INSTR_TYPE_MOTION, 6, 14, decode_instruct_triggc_proc},
	{"TRIGGLIOS", D_INSTR_TYPE_MOTION, 4, 10, decode_instruct_trigglios_proc},
	{"CLEARPATH", D_INSTR_TYPE_MOTION, 0, 0, decode_instruct_clearpath_proc},
	{"STOREPATH", D_INSTR_TYPE_MOTION, 0, 1, decode_instruct_storepath_proc},
	{"RESTOPATH", D_INSTR_TYPE_MOTION, 0, 0, decode_instruct_restopath_proc},
	{"STARTMOVE", D_INSTR_TYPE_MOTION, 0, 1, decode_instruct_startmove_proc},
	{"STARTMOVERETRY", D_INSTR_TYPE_MOTION, 0, 0, decode_instruct_startmoveretry_proc},
	{"STOPMOVE", D_INSTR_TYPE_MOTION, 0, 2, decode_instruct_stopmove_proc},
	{"STOPMOVERESET", D_INSTR_TYPE_MOTION, 0, 1, decode_instruct_stopmovereset_proc},
*/
//};
/**********************************************************************/

/**********************************************************************/
/*以下开始函数定义*/
/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeInitInstrIndexInfo(void)
{
#if 0
    int flag = 0;
    int i, j;
    int m = 0;

    for(i=1; i<=DECODE_STR_NAME_LEN; i++){
        for(j=0; j<INSTR_END_CNT; j++){
            if((int)strlen(DecodeInstrInfoGlobalTable[j].instrOrg[0].name) == i){
                if(flag == 0){
                    flag = 1;
                    DecodeInstrIndexInfoGlobalTable.beginPos[i] = m;
                }
                DecodeInstrIndexInfoGlobalTable.instructionIndex[m].index = j;
                strcpy(DecodeInstrIndexInfoGlobalTable.instructionIndex[m].instrName, DecodeInstrInfoGlobalTable[j].instrOrg[0].name);
                m++;
            }
        }
        if(flag == 1){
            DecodeInstrIndexInfoGlobalTable.endPos[i] = m;
            flag = 0;
        }
    }
#else
    //    int flag = 0;
        int i, j;
        decode_character_property charPro;

        for (i=1; i<INSTR_END_CNT; i++) {//首个保留，所以从1开始
            //strcpy(charPro.charName, DecodeTypeInfoGlobalTable[i].typeElement[0].elementName);
            memset (&charPro, 0, sizeof(decode_character_property));
            strcpy(charPro.charName, DecodeInstrInfoGlobalTable[i].instrOrg[0].name);
            charPro.charType = D_CHAR_TYPE_INSTRUCTION;
            charPro.selfIndex = i;
            if (createOneCharacterIndex(charPro) == -1) {
                return -1;
            }
        }
#endif
    return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeGetInstructionIndex(char *str)
{
    int pos = strlen(str);
    int i;
    int index = -1;

    i = DecodeInstrIndexInfoGlobalTable.beginPos[pos];
    for( ; i<DecodeInstrIndexInfoGlobalTable.endPos[pos]; i++){
        if(strcmp(str, DecodeInstrIndexInfoGlobalTable.instructionIndex[i].instrName) == 0){
            index = DecodeInstrIndexInfoGlobalTable.instructionIndex[i].index;
            break;
        }
    }
    return index;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeInstructionLexicalAnalysis(char *str[], decode_instr_parse_info *parse_info)
{
    int i = 1;//除去自身，从1开始
    int j = 0;
    int pos;
    int last_grp = -1;//记录上一次的参数所在的组
    int opt_mask, grp_mask, type_mask;

    decode_instruction_info *p_instruction_info;


    pos = decodeGetInstructionIndex(str[j++]);

    if(pos >= 0){
        p_instruction_info = &DecodeInstrInfoGlobalTable[pos];
        while(p_instruction_info->instrOrg[i].mask != -1){
            type_mask = p_instruction_info->instrOrg[i].mask & 0xFF;//变量类型
            grp_mask = (p_instruction_info->instrOrg[i].mask >> 16) & 0xF;//所在的组
            opt_mask = (p_instruction_info->instrOrg[i].mask >> 24) & 0xF;//

            if(opt_mask > 0){//为必选参数
                if(type_mask){//直接索引界面，察看该类型的变量是否存在
                    //该类型变量不存在，报警退出
                    break;
                }
                //如果参数存在，设置指针指向，并设置使用的掩码位
                parse_info->mark.mask |= 1<<i;//设置为1，表明使用该参数
                //parse_info->m_mark.m_parg[i] = ;//指针
                j++;
            }else{//为可选参数
                if(last_grp == grp_mask){//可选参数同组，互斥型不能同时出现，因此要报错
                    //添加互斥型可选参数不能同时出现，需要报警
                    break;
                }
                if(strncmp(str[j], p_instruction_info->instrOrg[i].name, strlen(p_instruction_info->instrOrg[i].name)) == 0){
                    //如果参数存在，设置指针指向，并设置使用的掩码位，可选参数要从:=后开始
                    parse_info->mark.mask |= 1<<i;//设置为1，表明使用该参数
                    //parse_info->m_mark.m_parg[i] = ;//指针
                    j++;
                }
            }
            last_grp = grp_mask;
            i++;
        }
    }
    return 0;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_accset_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_worldacclim_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_pathacclim_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_speedlimaxis_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_speedlimcheckpoint_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_speedrefresh_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_velset_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_confj_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_confl_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_actunit_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_deactunit_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_mechunitload_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_gripload_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_motionsup_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_singarea_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_cirpathmode_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_eoffson_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_eoffsoff_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_eoffsset_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_pdispset_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_pdispon_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_pdispoff_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggcheckio_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggio_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggequip_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggint_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggrampao_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggspeed_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_moveabsj_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_moveextj_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeInstructMovejAnalysis(char *str[], decode_instr_parse_info *pinfo)
{
	int mutex_flag = 0;//互斥型可选参数互斥标志
	int str_pos = 0;//字符串索引下标，找到匹配后才前进
//	instr_movej_data *p_movej_data = &pinfo->m_instr_data.m_movej_data;
//以下按命令参数出现的顺序排列，全部用大写比较
	if(strncmp(str[str_pos], "\\CONC", 5) == 0){
		str_pos++;
	}

	if(1){//索引ToPoint(robtarget类型)正确
		str_pos++;
	}

	if(strncmp(str[str_pos], "\\ID", 3) == 0){
		str_pos++;
	}

	if(1){//索引Speed(robtarget类型)正确
		str_pos++;
	}

	if(strncmp(str[str_pos], "\\V", 2) == 0){
		mutex_flag = 1;
		str_pos++;
	}

	if(mutex_flag == 0 && strncmp(str[str_pos], "\\T", 2) == 0){
		str_pos++;
	}
	mutex_flag = 0;

	if(1){//Zone
		str_pos++;
	}

	if(strncmp(str[str_pos], "\\Z", 2) == 0){
		str_pos++;
	}

	if(strncmp(str[str_pos], "\\INPOS", 6) == 0){
		str_pos++;
	}

	if(1){//Tool
		str_pos++;
	}

	if(strncmp(str[str_pos], "\\WOBJ", 5) == 0){
		str_pos++;
	}

	if(strncmp(str[str_pos], "\\TLOAD", 6) == 0){

	}



	return 1;
}

int decodeInstructMovejExecute(decode_instr_parse_info *pinfo)
{
//	int i = 1;//自身的字符串需要忽略
//	int mask = pinfo->m_mark.m_mask;
    instr_movej_data *p_movej_data = (instr_movej_data *)&pinfo->instrData.movejData;

    memcpy(p_movej_data, pinfo->mark.m_parg, sizeof(instr_movej_data));

	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_movel_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_movec_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_searchc_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_searchextj_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_searchl_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggj_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggl_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_triggc_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_trigglios_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_clearpath_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_storepath_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_restopath_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_startmove_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_startmoveretry_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_stopmove_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_instruct_stopmovereset_proc(char *str[])
{
	return 1;
}
/**********************************************************************/

/**********************************************************************/ 
/*函数功能：*/ 
/*输入参数： 参数1：注明输入参数意义及有效性范围*/			
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/
